{
  "Order": 99,
  "Title": "How to Contribute",
  "Html": "<p>The following is a set of guidelines for contributing to Ant Design Blazor. Please spend several minutes in reading these guidelines before you create an issue or pull request.</p>\n<h2>Code of Conduct</h2>\n<p>We have adopted a <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a> that we expect project participants to adhere to. Please read the full text so that you can understand what actions will and will not be tolerated.</p>\n<h2>Open Development</h2>\n<p>All work on ant-design-blazor happens directly on <a href=\"https://github.com/ant-design-blazor/ant-design-blazor\">GitHub</a>. Both core team members and external contributors send pull requests which go through the same review process.</p>\n<h2>Bugs</h2>\n<p>We are using <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/issues\">GitHub Issues</a> for bug tracing. The best way to get your bug fixed is using our <a href=\"https://ng.ant.design/issue-helper/#/en\">issue helper</a>.</p>\n<p>Before you reporting a bug, please make sure you've searched exists issues, and read our <a href=\"docs/faq\">FAQ</a>.</p>\n<h2>Proposing a Change</h2>\n<p>If you intend to change the public API or introduce new feature, we also recommend use our <a href=\"https://ng.ant.design/issue-helper/#/en\">issue helper</a> to create a feature request issue.</p>\n<h2>Your First Pull Request</h2>\n<p>Working on your first Pull Request? You can learn how from these resources:</p>\n<ul>\n<li><a href=\"https://opensource.guide/how-to-contribute/\">How to Contribute to Open Source</a></li>\n<li><a href=\"https://github.com/firstcontributions/first-contributions\">First Contributions</a></li>\n</ul>\n<p>To help you get your feet wet and get you familiar with our contribution process, we have a list of <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/labels/good%20first%20issue\">Good First Issue</a> that contain bugs or small features that have a relatively limited scope. This is a great place to get started.</p>\n<p>If you decide to fix an issue, please be sure to check the comment thread in case somebody is already working on a fix. If nobody is working on it at the moment, please leave a comment stating that you intend to work on it so other people don’t accidentally duplicate your effort.</p>\n<p>If somebody claims an issue but doesn’t follow up for more than two weeks, it’s fine to take over it but you should still leave a comment.</p>\n<h2>Contribute</h2>\n<p>The core team is monitoring for pull requests. We will review your pull request and either merge it, request changes to it, or close it with an explanation.</p>\n<p><strong>Before submitting a pull request</strong>, please make sure the followings are done:</p>\n<ol>\n<li>Run <code>dotnet build</code> in the repository root.</li>\n<li>If you’ve fixed a bug or added code that should be tested, add tests!</li>\n<li>Make sure the test suite passes (<code>dotnet test</code>).</li>\n<li>Make sure your code lints (<code>dotnet build</code>).</li>\n<li>Make sure rebase your code to keep the history clean.</li>\n<li>Make sure your commit message meet the <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/blob/master/CONTRIBUTING.md#-commit-message-guidelines\">guidelines</a></li>\n</ol>\n<h2>How to send a Pull Request</h2>\n<ol>\n<li>fork the repo of <code>ant-design-blazor</code></li>\n<li>On <code>master</code>: <code>git remote add upstream https://github.com/ant-design-blazor/ant-design-blazor.git</code></li>\n<li>On <code>master</code>: <code>git pull upstream master</code></li>\n<li>On <code>master</code>: <code>git push origin master</code></li>\n<li>Checkout the feature branch (for example if the branch is called <code>docs-fix</code>): <code>git checkout docs-fix</code></li>\n<li>On <code>docs-fix</code> I rebase: <code>git rebase origin/master</code></li>\n<li>On <code>docs-fix</code> change the code and commit: <code>git commit -a</code>, you need to follow the <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/blob/master/CONTRIBUTING.md#-commit-message-guidelines\">commit message guidelines</a></li>\n<li>Then, push up: <code>git push</code> (might need <code>-f</code>, just be sure you understand force pushing before you do it)</li>\n<li>Send Pull Request in the Github</li>\n</ol>\n<h2>Development Workflow</h2>\n<p>After cloning <code>ant-design-blazor</code> and running <code>npm install</code> to fetch its dependencies, you can run the following commands:</p>\n<ul>\n<li><code>dotnet run</code> runs ant-design-blazor website locally.</li>\n<li><code>dotnet build</code> checks the code style.</li>\n<li><code>dotnet test</code> runs the complete test suite.</li>\n<li><code>dotnet publish -c release -o publish</code> creates build of <code>ant-design-blazor</code>.</li>\n</ul>\n<p>If you running into problems while developing ant-design-blazor, you can refer to our <a href=\"https://github.com/ant-design-blazor/ant-design-blazor/wiki/Development-Guide\">developement guide</a> on GitHub.</p>\n"
}